<template>
  <div class="protocol">
    <h3>
      数据采集服务协议
    </h3>
    <p>
      合同编号：<u class="sign">{{protocolID}}</u>
    </p>
    <p>
      本协议是您（下称"用户"、"您"）与青岛市城阳区中德汇都小额贷款有限公司（下称"富卡"、"我们"）之间就"个人信息授权"相关事宜（下称"本服务"）所订立的协议。
    </p>
    <p>
      本协议包含了富卡数据采集、存储、保护和使用您的个人信息条款，我们建议您完整地阅读本协议条款，<u>特别是以下划线、加粗等方式</u>标注与您的权益存在或可能存在重大关系的部分。除非您接受本协议全部条款，否则请不要使用本服务。您点击"同意并继续"按钮后，即表示您已同意我们按照本协议来合法使用和保护您的个人信息。
    </p>
    <p>
      为充分保障您个人信息的安全，富卡在此特别声明：
    </p>
    <p>
      <b>
        1、鉴于您须授权商业伙伴并由该商业伙伴告知本服务后方能进入并使用本服务，自您使用本服务时起即视为您与商业伙伴之间已存在合法的、充分的、必要的、不可撤销的授权。即您已明确授权商业伙伴为验证您的真实身份及评估您的信用信息而对您的身份信息及相关信用信息进行获取、验证、存储并在约定范围内使用。
      </b>
    </p>
    <p>
      <u>
        2、富卡仅是您授权采集和使用您个人信息的技术服务提供方。您在此明确授权并同意，由富卡对您的信息进行加工、存储、整理并提供给商业伙伴在约定范围内使用。富卡会采取合理、必要措施以保护您的隐私和信息安全。
      </u>
    </p>
    <p>
      <u>
        3、未经您的授权，富卡不会将您的信息提供给任何其他第三方。
      </u>
    </p>
    <p>
      <u>
        4、富卡不会保存您的账户密码信息，富卡仅会在您每次单独授权的情况下，方予采集相应信息，富卡绝不会主动自行采集您的任何信息。
      </u>
    </p>
    <h3>
      第一章 数据采集服务
    </h3>
    <p>
      第一条
      富卡无法确保您授权采集的个人信息源数据的准确性、数据采集通道是否持续通畅，因此富卡无法保证本服务提供的持续性、及时性、准确性，如您发现经富卡数据采集的个人信息数据提供给经您授权的商业伙伴存在不准确或错误的情况，可联系您信息所在平台进行更正或删除。
    </p>
    <p>
      <u>
        第二条 您在此充分地、有效地、不可撤销地明示同意并授权富卡采集以下个人信息：
      </u>
    </p>
    <p>
      1、用户注册富卡账号时，用户根据富卡要求提供个人注册信息，包括但不限于姓名、性别、身份证号码、活体识别、住址、联系方式等；
    </p>
    <p>
      2、在用户使用富卡产品服务，或访问富卡产品时，富卡自动接收并记录的用户浏览器和设备上的信息，包括但不限于用户的宽带类型、IP地址、浏览器的类型、使用的语言、访问的日期和时间、软硬件特征信息等数据；
    </p>
    <p>
      3、用户使用富卡产品时，进行授权登录、导入账单等操作所提供的邮箱、网银、电商、通讯运营商等相关个人信息，具体如下：
    </p>
    <p>
      ①通讯运营商信息：登记姓名、手机号码、身份证号码、套餐信息、账单信息、通话记录等；
    </p>
    <p>
      ②邮箱信息：账号信息、发件人、主题、所在文件夹，根据关键字在用户"收件箱"、"已发送"、"群邮件"内的邮件进行匹配，包括银行电子账单的相关信息等；
    </p>
    <p>
      ③电商平台信息：实名认证状态、本人收货人姓名、本人收货人固话/手机、本人收货人地址、权益信息（花呗额度、白条额度）；
    </p>
    <p>
      ④支付宝信息：绑定手机号（前3后4位）、实名认证状态、逾期还款记录；
    </p>
    <p>
      ⑤公积金信息：公积金所在地、缴纳公积金单位名称、账户余额、缴纳比例、缴纳基数、缴纳记录、是否有贷款及贷款相关状态、贷款购房地址等；
    </p>
    <p>
      ⑥社保信息：社保缴纳所在地、缴纳单位、缴纳比例、缴纳基数、缴纳记录、投保信息、医保记录（疾病和病史信息等法律禁止采集的信息除外）等；
    </p>
    <p>
      ⑦车险保单信息：车辆投保人姓名、身份证，车辆投保信息、车辆基本信息（车牌号、车辆型号、出厂日期、发动机号、车架号等）、车辆出险记录等；
    </p>
    <p>
      ⑧QQ信息：用户QQ注册信息、昵称；
    </p>
    <p>
      ⑨职业相关信息：用户姓名、教育背景、职业经历、职位、职务等信息；
    </p>
    <p>
      ⑩学历学籍信息：学信网用户注册信息、姓名、身份证号码、学历学籍信息（专业入学/毕业时间、证书照片）等；
    </p>
    <p>
      ⑪个人征信信息：央行个人信用中心用户姓名、身份证（掩码）、银行卡数量、信用卡数量、信用卡额度、额度使用信息、还款逾期信息、个人信用被查询记录、房贷信息等；
    </p>
    <p>
      ⑫个人借款信息：用户在第三方借款平台的姓名、身份证号码、联系方式、借款记录、逾期信息等；
    </p>
    <p>
      ⑬本地通讯录信息：包括姓名、电话号码；
    </p>
    <p>
      ⑭微信相关信息：用户头像、用户昵称等；
    </p>
    <p>
      ⑮其他经用户明确授权的相关信息。
    </p>
    <p>
      4、在用户使用富卡提供的相关业务时，用户应确认已对商业伙伴（如借款平台、消费金融公司等）进行有效的、充分的、不可撤销的授权，授权该等商业伙伴查询、验证用户的相关个人信息并以信用评估为目的进行使用。为实现用户与商业伙伴之间的合作目的，用户及商业伙伴有效的、充分的、不可撤销的授权富卡对上述商业伙伴需要查询、验证或评估用户的个人信息进行收集、查询验证、处理并提供给商业伙伴在约定范围内进行使用。富卡将通过用户提供的个人信息向依法设立的征信机构查询用户的相关信用信息，包括但不限于全部信用记录、信用分、信用报告等信息；
    </p>
    <p>
      5、富卡不会采集用户的宗教信仰、基因、指纹、血型、疾病、和病史信息以及法律、行政法规规定禁止采集的其他个人信息。
    </p>
    <h3>
      第二章 信息使用
    </h3>
    <p>
      第三条 富卡将以高度的勤勉、审慎义务对待用户个人信息，为使用户个人知晓用户数据所经流程，富卡特告知如下：富卡在授权范围内为实现用户与商业伙伴之间的合同目的，对授权采集的用户信息将进行以下处理与使用：
    </p>
    <p>
      1、<u>将信息进行归类整合和处理（数据清洗、加密与掩码等）</u>，以提供给商业伙伴对用户信用情况进行评估，并以此对富卡的服务进行改进；
    </p>
    <p>
      2、<u>比较信息的准确性并与第三方进行验证</u>，例如，将用户向富卡提交的身份信息与身份验证的服务机构进行验证；
    </p>
    <p>
      3、经用户明确同意并授权的其他用途；
    </p>
    <p>
      4、<u>除本协议明确阐述和相关法律规定外，富卡不会向任何无关第三方提供、披露或交易用户的个人信息。</u>
    </p>
    <h3>
      第三章 除外责任
    </h3>
    <p>
      <u>
        第四条
        因您的过错导致的任何损失，该过错包括但不限于：操作不当、遗忘或泄露密码、密码被他人破解、您使用的计算机系统被第三方侵入、用户委托他人代理使用本服务时他人恶意或不当操作而造成的损失，由您自行负责。除非富卡单方故意或重大过失直接导致您遭受损失外，富卡不承担责任。
      </u>
    </p>
    <h3>
      第四章 账户安全及管理
    </h3>
    <p>
      第五条 您了解并同意，确保基于使用本服务所需账户及密码的机密安全对您非常重要，您应妥善保管这些机密信息。您将对利用该账户及密码所进行的一切行动及言论，负完全的责任，并同意以下事项：
    </p>
    <p>
      1、您不对其他任何人泄露账户和密码，亦不可使用其他任何人的账户和密码。因黑客、病毒或您的保管疏忽等非富卡原因导致您的账户遭他人非法使用的，富卡不承担责任；
    </p>
    <p>
      2、冒用他人账户及密码的，富卡及第三方机构保留追究实际使用人连带责任的权利。
    </p>
    <p>
      第六条
      如发现有第三人冒用或盗用您的账户及密码，或其他任何未经您合法授权而使用的情形，您应立即以有效方式通知富卡，且马上修改密码，要求富卡暂停相关服务。同时，您理解富卡对您的请求采取行动需要合理期限，在此之前，富卡对第三人使用该服务所导致的损失不承担责任。
    </p>
    <p>
      第七条 富卡有权基于单方独立判断，在认为可能不利于富卡提供服务或涉及违法违规的情形时，可不经通知而先行暂停、中断或终止向您提供本协议项下的全部或部分服务，且无需因此对您或任何第三方承担任何责任。
    </p>
    <h3>
      前述情形包括但不限于：
    </h3>
    <p>
      1、富卡认为您不是采集信息的信息权利人时；
    </p>
    <p>
      2、富卡发现异常情况或有合理理由怀疑操作有风险或有违法之虞时；
    </p>
    <p>
      3、富卡认为账户存在未经授权的使用或其他富卡认为有风险之情形；
    </p>
    <p>
      4、富卡认为您已经违反本协议中规定的各类规则；
    </p>
    <p>
      5、富卡基于上述原因之外，根据其单独判断需先行暂停、中断或终止向您本协议项下的全部或部分用户服务。
    </p>
    <h3>
      第五章 服务中断或故障
    </h3>
    <p>
      第八条 您同意，因下列原因导致富卡及第三方机构无法正常提供服务的，富卡及第三方机构不承担责任：
    </p>
    <p>
      1、富卡及第三方机构等承载本服务的系统停机维护期间；
    </p>
    <p>
      2、你的电脑、手机软件、通讯线路及供电线路出现故障的；
    </p>
    <p>
      3、您操作不当或通过非富卡及第三方机构授权或认可的方式使用本服务的；
    </p>
    <p>
      4、因病毒、木马、恶意程序攻击、网络拥堵、系统不稳定、系统或设备故障、通讯故障、电力故障或政府行为等原因；
    </p>
    <p>
      5、由于黑客攻击、网络供应商技术调整或故障、网站升级、公积金系统方面的问题等原因而造成的本服务中断或延迟；
    </p>
    <p>
      6、因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力因素，造成本服务系统障碍不能执行业务的。
    </p>
    <p>
      尽管有前款约定，富卡及第三方机构将采取合理行动积极促使服务恢复正常。
    </p>
    <h3>
      第六章 隐私权保护及授权条款
    </h3>
    <p>
      <u>
        第九条富卡不会保存您的密码。
      </u>
    </p>
    <p>
      第十条 你授权富卡到相应的个人信息源数据网站采集您的授权个人信息。
    </p>
    <p>
      <u>
        第十一条 本服务的数据获取是一次性的，除非得到您的再次授权，否则富卡不会发起登录而采集您的信息。
      </u>
    </p>
    <p>
      第十二条富卡将对用户提供的信息严格保密，除具备下列情形之一外，不会向任何外部机构披露：
    </p>
    <p>
      <u>
        1、经过用户事先同意而披露，即在获得用户明确同意的情形下，富卡才会在授权范围内向特定被授权方披露用户的个人信息；
      </u>
    </p>
    <p>
      2、应法律法规或公权力部门要求而披露，即富卡可能会根据法院、政府部门、上级监管机构等执法机构或法律法规的要求向其披露用户的个人信息；
    </p>
    <p>
      3、当富卡涉及合并、收购或资产出售等重大交易时，富卡有权依据交易的需要将用户信息提供给交易相对方及交易各方聘请的各中介机构（包括但不限于律师、会计师等），富卡会在任何个人信息进行转让或其他隐私权政策约束之前，继续确保其保密性并对收到影响方进行及时通知。
    </p>
    <h3>
      第七章 条款的解释、法律适用及争端解决
    </h3>
    <p>
      第十三条 本协议是由您与富卡共同签订的，适用于您在本服务项下的全部活动。
    </p>
    <p>
      第十四条
      如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，则应认为该条款可与本协议相分割，并可被尽可能接近各方意图的、能够保留本协议要求的经济目的的、有效的新条款所取代，而且，在此情况下，本协议的其他条款仍然完全有效并具有约束力。
    </p>
    <p>
      第十五条本协议有效性、履行与本协议所有事宜，仅适用中华人民共和国法律。
    </p>
    <p>
      <u>
        第十六条 本协议签订地为北京市朝阳区。因本协议所引起的您与富卡的任何纠纷或争议，首先应友好协商解决，协商不成的，您同意将纠纷或争议提交北京市朝阳区人民法院诉讼解决。
      </u>
    </p>
    <p>
      第十七条 用户如需更正所提供的个人信息，或希望停职接受富卡提供的服务，或对本协议有任何疑问，请通过以下途径联系富卡处理：
    </p>
    <p>
      <u>
        E-mail:kefu@fuyinhy.com
      </u>
    </p>
    <p>
      用户：<u class="sign">{{userName}}</u>
    </p>
    <p>
      乙方：<u>青岛市城阳区中德汇都小额贷款有限公司</u>
    </p>
    <p>
      日期：<u class="sign">{{authTime}}</u>
    </p>
  </div>
</template>

<script>
  export default {
    name: "data-collection-service",
    data() {
      return {
        protocolID: this.$route.query.protocolID,
        userName: this.$route.query.userName,
        authTime: this.$route.query.authTime
      }
    },
    mounted() {
      document.title = '数据采集服务协议'
    }
  }
</script>

<style scoped lang="less">
  .protocol {
    width: 100%;
    display: flex;
    flex-direction: column;
    justify-content: center;
    align-items: center;
    font-size: 0.28rem;
    line-height: 0.42rem;
    padding-bottom: 1rem;

    .sign {
      color: #45403d;
      font-weight: bolder;
    }

    p {
      width: 92%;
      margin-top: 0.32rem;
    }

    h3 {
      width: 92%;
      margin-top: 0.6rem;
    }

    h2 {
      width: 92%;
      line-height: 0.8rem;
      margin-top: 0.3rem;
    }
  }
</style>
