<template>
  <div class="protocol">
    <h3>
      贷后服务协议
    </h3>
    <p>
      合同编号：<u class="sign">{{protocolID}}</u>
    </p>
    <h3>
      贷后服务协议
    </h3>
    <p>
      <b>
        甲方：<u class="sign">{{userName}}</u>
      </b>
    </p>
    <p>
      身份证号：<u class="sign">{{idNo}}</u>
    </p>
    <p>
      通讯地址：<u class="sign">{{postalAddress}}</u>
    </p>
    <p>
      电话：<u class="sign">{{phone}}</u>
    </p>
    <p>
      电子邮箱：<u class="sign">{{emailAddress}}</u>
    </p>
    <p>
      <b>
        乙方：富银弘远（厦门）信息科技有限公司
      </b>
    </p>
    <p>
      地址：北京市朝阳区东三环北路院2民生大厦20层
    </p>
    <p>
      邮编：100020
    </p>
    <p>
      <b>
        鉴于：
      </b>
    </p>
    <p>
      甲方通过线上平台撮合借款后，有贷后服务需求；乙方拥有成熟的贷后管理专业服务体系，有能力为甲方提供贷后服务并独立承担贷后催收的法律责任。根据《中华人民共和国合同法》，甲乙双方本着自愿、平等、公正的原则签署本合作协议。
    </p>
    <p>
      <b>
        第一条 服务内容与范围
      </b>
    </p>
    <p>
      甲方委托乙方，通过网络、电话、现场等方式向甲方提供贷后服务，包括但不限于：
    </p>
    <p>
      ⑴ 贷后咨询服务；
    </p>
    <p>
      ⑵ 贷后跟踪服务；
    </p>
    <p>
      ⑶ 贷后还款管理服务；
    </p>
    <p>
      ⑷ 仲裁对接技术服务；
    </p>
    <p>
      根据上述约定服务，甲方自愿向乙方支付约定的费用（包括但不限于违约金、罚息等）。
    </p>
    <p>
      <b>
        第二条 甲方权利义务
      </b>
    </p>
    <p>
      ⑴ 甲方在获取乙方贷后服务的全过程中，必须真实准确向乙方提供所要求提供的个人信息，如甲方提供不真实信息或有意隐瞒重要信息，视为违约，须对乙方承担违约责任；
    </p>
    <p>
      ⑵ 甲方自愿授权乙方基于甲方提供的信息及乙方独立获取的信息管理甲方的信用信息，并提供贷后服务；
    </p>
    <p>
      ⑶ 甲方同意，乙方协调甲方按照约定期限及金额进行还款，甲方有义务无条件及时配合乙方工作；
    </p>
    <p>
      ⑷ 乙方为甲方提供仲裁对接技术服务；
    </p>
    <p>
      ⑸ 甲方有义务按照本协议的规定向乙方支付相关费用（包括但不限于违约金、罚息等）。
    </p>
    <p>
      <b>
        第三条 乙方权利义务
      </b>
    </p>
    <p>
      ⑴ 乙方接受甲方的委托后，须为甲方提供约定的贷后服务的全程信息，并在过程中协助其办理各项手续；
    </p>
    <p>
      ⑵ 乙方有权通过甲方提供的个人信用信息及行为记录进行审核，根据甲方需要可以为甲方提供上述贷后服务内容的相关建议；
    </p>
    <p>
      ⑶ 乙方有权根据乙方对甲方的贷后服务情况决定是否进一步提供贷后服务；
    </p>
    <p>
      ⑷ 若甲方存在违反与特定资金提供方签订的协议条款，逾期偿还借款或者存在其他违约行为，乙方有权随时终止为甲方提供贷后服务，且无需另行通知甲方，乙方不会因此而向甲方承担任何违约责任；
    </p>
    <p>
      ⑸ 若甲方存在违反与特定资金提供方签订的协议条款，逾期偿还借款或者存在其他违约行为，乙方有权通过诉讼或仲裁等方式解决，甲方接受乙方为甲方提供的仲裁对接技术服务；
    </p>
    <p>
      ⑹ 乙方有权向甲方收取约定的相关费用（包括但不限于违约金、罚息等）。
    </p>
    <p>
      <b>
        第四条 费用及支付方式
      </b>
    </p>
    <p>
      （1）若甲方存在违反与特定资金提供方签订的协议条款，逾期偿还借款或者存在其他违约行为时，甲方须给付资金提供方违约金、罚息等相关费用。
    </p>
    <p>
      （2）甲方同意在偿还每期借款利息与本金时支付相关费用（包括但不限于违约金、罚息等），相关费用计算方式如下：
    </p>
    <p>
      说明：罚息=当前逾期本金*逾期天数*0.098%
    </p>
    <p>
      例如：用户在1月1日借款10000元，分3期还款，还款计划如下：
    </p>
    <table border="1">
      <thead>
      <tr>
        <th>期数</th>
        <th>还款日</th>
        <th>本金</th>
        <th>利息</th>
        <th>服务费</th>
        <th>总还款额</th>
      </tr>
      </thead>
      <tbody>
      <tr>
        <th>第一期</th>
        <th>2月1日</th>
        <th>3235.34</th>
        <th>120.00</th>
        <th>179.90</th>
        <th>3535.24</th>
      </tr>
      <tr>
        <th>第二期</th>
        <th>3月1日</th>
        <th>3332.36</th>
        <th>81.18</th>
        <th>121.70</th>
        <th>3535.24</th>
      </tr>
      <tr>
        <th>第三期</th>
        <th>4月1日</th>
        <th>3432.30</th>
        <th>41.19</th>
        <th>61.75</th>
        <th>3535.24</th>
      </tr>
      </tbody>
    </table>
    <p>
      ①、用户在2月1日未还款，逾期未到3月1日时，对其催收第一期（本金+利息+服务费+罚息）。
    </p>
    <p>
      ②、用户在2月1日未还款，至3月1日仍未还款（含3月1日当天），对其催收第一期（本金+利息+服务费+罚息）、第二期（本金+利息+服务费）、第三期（本金）。
    </p>
    <p>
      ③、用户在2月1日未还款，至4月1日仍未还款（含4月1日当天），对其催收第一期（本金+利息+服务费+罚息）、第二期（本金+利息+服务费+罚息）、第三期（本金+利息+服务费）。
    </p>
    <p>
      ④、⑴	 用户在2月1日未还款，至4月1日后仍未还款，对其催收第一期（本金+利息+服务费+罚息）、第二期（本金+利息+服务费+罚息）、第三期（本金+利息+服务费+罚息）。
    </p>
    <p>
      （3）如果一期借款逾期至下一个还款日仍未还款，须将剩余所有未还本金一次性偿还，但对所有到期已产生的费用不予免除。
    </p>
    <p>
      （4）本条约定的费用甲方授权乙方或乙方委托的第三方合作机构或银行在甲方偿还每期借款利息与本金时支付。
    </p>
    <p>
      <b>
        第五条 违约责任
      </b>
    </p>
    <p>
      任何一方违反本协议约定，使得本协议的全部或部分不能履行，均应承担违约责任，并赔偿对方因此遭受的损失（包括由此产生的诉讼费和律师费等其他费用）；如双方均违约，根据实际情况各自承担相应责任。甲方授权乙方及乙方合作的第三方保留将甲方违约失信的相关信息在媒体披露的权利。因甲方违约而产生的调查及诉讼费用由甲方承担。
    </p>
    <p>
      <b>
        第六条 通知
      </b>
    </p>
    <p>
      ⑴	为通知之目的，甲方提供的通讯地址（包括但不限于本协议约定及/或其他方式向乙方提供的住址、通讯地址、电子邮箱、通讯电话等）为乙方寄送有关文件或发生法律争议时有关法律机构寄送有关文件的法定有效地址。如地址无法送达，乙方可选择在指定平台公告的方式予以公告送达（地址及公告的适用范围包括非诉阶段和争议进入仲裁、民事诉讼程序中的一审、二审、再审和执行程序）。如发生文件不能送达的情况，包括但不限于拒收、无法查找地址、查无此人等，其法律后果由甲方承担，并视为乙方或有关法律机构已经完成送达（邮寄送达的，自文书被签收或被拒收、退回之日视为送达之日；直接送达的，受送达人当场在送达回证上记明情况之日视为送达之日；电子邮箱和移动电话短信送达的，邮件或短信发出之日视为送达之日；指定平台公告送达的，公告作出之日视为送达之日）。
    </p>
    <p>
      ⑵	甲方有义务在其重要信息变更之日起三日内提供更新后的信息给乙方和出借人，包括但不限于：甲方本人、甲方的家庭联系人及紧急联系人的下列信息：工作单位名称、电话及地址、居住地址、居住地电话、手机号码、电子邮箱。若因甲方不及时提供上述变更信息而带来的乙方的调查及诉讼等其他相关费用由甲方承担。
    </p>
    <p>
      ⑶	本条关于相关文件及法律文书的送达地址所做的约定，属于协议中独立存在的有关有效送达地址的确认条款，若发生本协议被全部或部分确认无效或撤销等情形时，本条款继续有效。
    </p>
    <p>
      <b>
        第七条 其他
      </b>
    </p>
    <p>
      ⑴	本协议采用电子文本形式制成，并保存在乙方或乙方委托合作的第三方为此设立的专用服务器上备查，本协议各方均认可该形式的协议效力。
    </p>
    <p>
      ⑵	双方以书面形式（包括电子文本等）签订的补充协议与本协议具有同等的法律效力。补充协议若与本协议冲突，以补充协议为准。
    </p>
    <p>
      ⑶	甲乙双方确认，本协议的签署、生效和履行以不违反中国的法律法规为前提。如果本协议中的任何一条或多条违反适用的法律法规，则该条被视为无效，但该无效条款并不影响本协议其他条款的效力。
    </p>
    <p>
      ⑷	本协议有关的一切争议，均提请衢州仲裁委员会仲裁，并适用其网络仲裁规则（包括适用互联网金融仲裁特别规定条款），衢州仲裁委员会的裁决为终局裁决，对双方具有法律约束力。
    </p>
    <p>
      用户确认以<u class="sign">{{emailAddress?emailAddress:'________________'}}</u>为联络邮箱，为双方之间及涉诉纠纷相关材料送达地址；并以<u class="sign">{{phone?phone:'________________'}}</u>为联络手机号码，为短信通知号码。按本协议约定由任何一方发给其他方的任何通知，应以电子邮件或者短信等形式发出，送至约定邮箱或者手机号码。收件人指定系统接受材料或通知之日，即视为送达和收到之日。如一方需变更联络邮箱或者手机号码的，应当书面通知并得到对方确认。
    </p>
    <p>
      ⑸	本协议自文本最终生成之日起生效。
    </p>
    <p>
      <b>
        协议各方签字
      </b>
    </p>
    <p>
      <b>
        甲方：<u class="sign">{{userName}}</u>
      </b>
    </p>
    <p>
      <b>乙方：</b>富银弘远（厦门）信息科技有限公司
    </p>
    <p>
      日期：<u class="sign">{{authTime}}</u>
    </p>
  </div>
</template>

<script>
  export default {
    name: "after-loan-service",
    data() {
      return {
        protocolID: this.$route.query.protocolID,
        userName: this.$route.query.userName,
        idNo: this.$route.query.idNo,
        postalAddress: this.$route.query.postalAddress,
        emailAddress: this.$route.query.emailAddress,
        phone: this.$route.query.phone,
        authTime: this.$route.query.authTime
      }
    },
    mounted() {
      document.title = '贷后服务协议'
    }
  }
</script>

<style scoped lang="less">
  .protocol {
    width: 100%;
    display: flex;
    flex-direction: column;
    justify-content: center;
    align-items: center;
    font-size: 0.28rem;
    line-height: 0.42rem;
    padding-bottom: 1rem;

    .sign {
      color: #45403d;
      font-weight: bolder;
    }

    p {
      width: 92%;
      margin-top: 0.32rem;
    }

    h3 {
      width: 92%;
      margin-top: 0.6rem;
    }

    h2 {
      width: 92%;
      line-height: 0.8rem;
      margin-top: 0.3rem;
    }
    table {
      width: 92%;
      margin-top: 0.32rem;
    }
  }
</style>
