<template>
  <div class="protocol">
    <h3>
      征信及信息披露授权书
    </h3>
    <p>
      合同编号：<u class="sign">{{protocolID}}</u>
    </p>
    <p>
      <b>
        尊敬的客户：为了维护您的权益，请在签署本授权书前，仔细阅读本授权书各条款，关注您在授权书中的权利、义务。您在授权人处签名或盖章的行为，即视为您已经认真阅读并充分理解本授权书的全部内容。
      </b>
    </p>
    <p>
      <b>授权方</b>（下称"本人"）：<u class="sign">{{userName}}</u>
    </p>
    <p>
      <b>被授权方：</b><u>富银弘远（厦门）信息科技有限公司</u>
    </p>
    <p>
      <b>
        第一条	 采集授权
      </b>
    </p>
    <p>
      <b>
        1.1本人同意并不可撤销地授权富卡采集、保存本人与其业务往来中提供或产生的个人信息（包括但不限于本人姓名、身份证号码、联系方式、地址、借款逾期情况等），并向中国人民银行金融信用信息基础数据库及/或其他经批准成立的征信机构及/或与被授权方具有合作关系的第三方（为方便表述，上述机构以下统称"征信机构"，与被授权方具有合作关系的第三方，以下可单独称为"富卡合作方"）提供本人个人信息和包括信贷信息在内的信用信息（含不良信用信息）。
      </b>
    </p>
    <p>
      <b>1.2本人特别授权富卡在向征信机构提供不良信用信息前，无需另行通知本人。</b>本人知悉富卡向征信机构提供不良信用信息前，可以选择以电子邮件、短信、纸质信件等任一方式通知本人。本人知悉，当本人联系信息变更时，需要及时更新，确保及时收到通知。若本人未及时更新，本人留存的联系方式视为有效联系方式，通过该联系方式通知本人时，视为有效送达本人。但是，依照法律、行政法规规定公开的不良信息除外。
    </p>
    <p>
      <b>
        1.3本人已经知悉在信息安全保障制度不完善的情况下，对外提供个人收入、存款、有价证券、商业保险、不动产的信息和纳税数额信息可能产生信息泄漏等不良影响。所以，在富卡及征信机构承诺保障本人信息安全的前提下，本人同意授权富卡向征信机构提供前述财产性信息。
      </b>
    </p>
    <p>
      <b>
        第二条	 使用授权及信息披露
      </b>
    </p>
    <p>
      <b>
        2.1本人同意授权征信机构在保证本人信息安全的前提下，保存、整理、加工第一条中所述的、通过合法途径采集的本人个人信息，并向中国境内的其他信息使用者提供。
      </b>
    </p>
    <p>
      <b>
        2.2本人同意授权富卡向征信机构查询、打印、保存本人被征信机构合法采集、整理或加工产生的其他信息提供方提供的本人个人信息和包括信贷信息在内的信用信息。
      </b>
    </p>
    <p>
      <b>
        2.3本人同意授权富卡通过征信机构向其他拥有合法资质的第三方（包括但不限于其他拥有合法资质的征信机构、运营商及其代理商等）查询或核实本人信息，并同意富卡及征信机构将查询获取的信息进行打印、保存、整理、加工，并用于评价本人信用情况或核实本人信息的真实性。但法律、法规、监管政策禁止查询的除外。
      </b>
    </p>
    <p>
      <b>
        2.4本人因与富卡及富卡合作方处申请相关业务或存在某种服务关系，富卡合作方可使用、保存、整理、加工富卡向其提供的本人征信及信用信息，并可自行通过征信机构向其他拥有合法资质的第三方（包括但不限于其他拥有合法资质的征信机构、运营商及其代理商等）查询或核实本人信息，并将该等信息与富卡进行共享。本人同意富卡合作方与富卡同等授权范围内进行上述信息采集、使用、披露行为且该行为已征得本人同意，无须另行书面授权。
      </b>
    </p>
    <p>
      <b>
        2.5本人同意授权富卡及征信机构将合法获取的本人信息披露或运用于为本人提供的下述业务中，包括：
      </b>
    </p>
    <p>
      <b>
        ⑴对本人或配偶提出的【贷款、租赁、赊购、投保、理赔、担保、投资】等业务的事前、事中、事后情况进行审查；
      </b>
    </p>
    <p>
      <b>
        ⑵对本人担任法定代表人、出资人或主要经营负责人的法人或其他组织的贷款或该法人或其他组织作为担保人，需要查询本人信用状况的；
      </b>
    </p>
    <p>
      <b>
        ⑶对本人提出的异议申请进行核查；
      </b>
    </p>
    <p>
      <b>
        ⑷向本人推荐产品及服务；
      </b>
    </p>
    <p>
      <b>
        ⑸当本人逾期还款时，对本人进行逾期追偿，追偿方式包括但不限于电话、现场、诉讼、仲裁等；
      </b>
    </p>
    <p>
      <b>
        ⑹依法或经有权部门要求的（包括但不限于公检法机关需要、会计师事务所审计、信息安全测评认证机构进行测评认证等）
      </b>
    </p>
    <p>
      <b>
        ⑺其他经过本人同意的合法用途。
      </b>
    </p>
    <p>
      <b>
        2.6如本人决定选择或接受富卡、富卡合作方的相关产品及服务时，本人即不可撤销同意富卡对本人的相关信息在富卡平台（该平台包括但不限于富卡官方网站www.fullcard.cn及其他移动客户端、app、微信公众号等富卡拥有经营及发布信息权利的平台）或富卡合作方平台向相应出借人或投资人进行合法披露，披露内容包括但不限于以下信息：
      </b>
    </p>
    <p>
      <b>
        ⑴本人基本信息（包括但不限于年收入、主要财产、主要债务、信用报告）；
      </b>
    </p>
    <p>
      <b>
        ⑵本人选择的产品项目或服务的基本信息，（包括但不限于项目或服务名称、类型、主要内容、审批文件、还款来源、借款用途、借款金额、借款期限、还款方式及利率）；
      </b>
    </p>
    <p>
      <b>
        ⑶富卡及/或合作方根据本人基本信息、征信包括、财产状况等综合评定的信用评级或者信用评分；
      </b>
    </p>
    <p>
      <b>
        ⑷在产品或服务履行期限内本人经营状况及财务状况、还款能力变化情况等；
      </b>
    </p>
    <p>
      <b>
        ⑸其他因服务需要富卡合法获取的信息、数据等。
      </b>
    </p>
    <p>
      <b>
        2.7本人不可撤销地授权富卡将本人自行提供或富卡采集的基本信息、征信信息、融资信息、交易记录以及其他信息向监管机关、行业协会（包括但不限于：中国互联网金融协会、北京市网贷行业协会等）进行数据共享、披露。监管机关、行业协会可依据本授权将上述信息用于行业信息共享系统的建设、使用以及其他合法用途。
      </b>
    </p>
    <p>
      2.8本协议有关的一切争议，均提请衢州仲裁委员会仲裁，并适用其网络仲裁规则（包括适用互联网金融仲裁特别规定条款），衢州仲裁委员会的裁决为终局裁决，对双方具有法律约束力。
    </p>
    <p>
      用户确认以<u class="sign">{{emailAddress?emailAddress:'________________'}}</u>为联络邮箱，为双方之间及涉诉纠纷相关材料送达地址；并以<u class="sign">{{phone?phone:'________________'}}</u>为联络手机号码，为短信通知号码。按本协议约定由任何一方发给其他方的任何通知，应以电子邮件或者短信等形式发出，送至约定邮箱或者手机号码。收件人指定系统接受材料或通知之日，即视为送达和收到之日。如一方需变更联络邮箱或者手机号码的，应当书面通知并得到对方确认。
    </p>
    <p>
      <b>
        本人已经详细阅读并充分理解本授权书的全部内容，同意按照本授权书约定执行。本人承诺本授权书授权事项为不可撤销之授权，自本人签字或以其他方式确认之日起即生效。
      </b>
    </p>
    <p>
      授权人签字：<u class="sign">{{userName}}</u>
    </p>
    <p>
      授权时间：<u class="sign">{{authTime}}</u>
    </p>
  </div>
</template>

<script>
  export default {
    name: "credit-information-disclosure",
    data() {
      return {
        protocolID: this.$route.query.protocolID,
        userName: this.$route.query.userName,
        authTime: this.$route.query.authTime,
        emailAddress: this.$route.query.emailAddress,
        phone: this.$route.query.phone
      }
    },
    mounted() {
      document.title = '征信及信息披露授权书'
    }
  }
</script>

<style scoped lang="less">
  .protocol {
    width: 100%;
    display: flex;
    flex-direction: column;
    justify-content: center;
    align-items: center;
    font-size: 0.28rem;
    line-height: 0.42rem;
    padding-bottom: 1rem;

    .sign {
      color: #45403d;
      font-weight: bolder;
    }

    p {
      width: 92%;
      margin-top: 0.32rem;
    }

    h3 {
      width: 92%;
      margin-top: 0.6rem;
    }

    h2 {
      width: 92%;
      line-height: 0.8rem;
      margin-top: 0.3rem;
    }
    table {
      width: 92%;
      margin-top: 0.32rem;
    }
  }
</style>
