<template>
  <div class="protocol">
    <h3>
      借款协议
    </h3>
    <p>
      合同编号：<u class="sign">{{protocolID}}</u>
    </p>
    <p>
      本借款协议（"本协议"） 以借款交付日期为签订日期：<u class="sign">{{authTime}}</u>
    </p>
    <p>
      甲方(借款人)：<u class="sign">{{userName}}</u>
    </p>
    <p>
      身份证号码：<u class="sign">{{idNo}}</u>
    </p>
    <p>
      乙方（出借人）：<u class="sign">{{userNameB}}</u>
    </p>
    <p>
      身份证号码：<u class="sign">{{idNoB}}</u>
    </p>
    <p>
      丙方：富银金融信息服务（北京）有限公司
    </p>
    <p>
      地址：福建省厦门市思明区观音山南投路11号荣鑫盛运营中心15楼
    </p>
    <p>
      鉴于：
    </p>
    <p>
      1、 丙方是一家在北京市合法成立并有效存续的有限责任公司，拥有www.dingdongqb.com网站以及对应的移动客户端的经营权；
    </p>
    <p>
      2、 甲方有借款需求，并将其主体及借款需求信息通过其代理人提供予丙方并由丙方在本平台发布；
    </p>
    <p>
      3、 乙方均已在本平台注册，同意以其自有资金进行出借；
    </p>
    <p>
      4、 甲乙双方均同意通过本平台或与本平台合作的第三方推荐平台进行网上点击操作从而签署电子合同的方式达成借款交易；；
    </p>
    <p>
      5、 甲方由富银弘远（厦门）信息科技有限公司推荐至丙方经营的本平台，并由丙方为各主体在本平台上达成的借贷交易提供网络借贷信息中介服务。
    </p>
    <p>
      据此，各方经协商一致，达成如下协议，以资共同遵照履行：
    </p>
    <h3>
      一、借款基本信息
    </h3>
    <p>
      甲方同意通过本平台向乙方借款如下，乙方同意通过本平台向甲方出借该等借款，借款基本信息如下：
    </p>
    <table border="1">
      <tbody>
      <tr>
        <th width="50%">借款用途</th>
        <td width="50%"><u class="sign">{{loanUsage}}</u></td>
      </tr>
      <tr>
        <th width="50%">借款本金数额</th>
        <td width="50%"><u class="sign">{{amount}}</u>（各出借人借款本金数额详见本协议文首表格）</td>
      </tr>
      <tr>
        <th width="50%">借款年利率</th>
        <td width="50%"><u class="sign">{{fee}}</u>%</td>
      </tr>
      <tr>
        <th width="50%">借款期限</th>
        <td width="50%"><u class="sign">{{limitDate}}</u></td>
      </tr>
      <tr>
        <th width="50%">月偿还本息数额</th>
        <td width="50%">第1至第【<u class="sign">{{startPDL}}</u>】期：￥<u class="sign">{{startAmount}}</u>；最后一期：￥<u class="sign">{{endAmount}}</u></td>
      </tr>
      <tr>
        <th width="50%">还款分期月数</th>
        <td width="50%"><u class="sign">{{stagesMonth}}</u>个月</td>
      </tr>
      <tr>
        <th width="50%">还款方式</th>
        <td width="50%"><u class="sign">{{repayMethod}}</u></td>
      </tr>
      <tr>
        <th width="50%">还款日 (下称"还款日")
        </th>
        <td width="50%">自<u class="sign">{{repayStart}}</u>起，每月<u class="sign">{{repayDate}}</u>。（如：生效日为10号，则每月还款日亦为10号；若当月没有该日，则还款日为当月最后一天。节假日不顺延）</td>
      </tr>
      </tbody>
    </table>
    <p>
      注：前述借款期限、还款日均根据本协议成立生效之日确定。
    </p>
    <h3>
      二、借款协议的订立及支付
    </h3>
    <p>
      2.1
      各方同意并确认，各方通过自行或授权其代理人根据本平台有关规则和说明，通过点击本移动客户端的相关按钮确认本协议范本以及各自承诺借入/出借金额、利率、期限进行借款申请和投标操作的方式来签署本协议，且并不以此为由拒绝履行本协议项下的义务，即使在签订时本协议并没有文首所列各甲方以及乙方的各项信息和本协议第1条项下的信息；且甲方、乙方在此不可撤销地同意授权丙方根据最终撮合结果自主生成前述信息，任何情况下均不得否认本协议项下债权债务关系或以任何方式撤回、撤销本协议。
    </p>
    <p>
      2.2
      各方在本平台进行借款申请操作和投标操作之前，均需仔细阅读并确认同意本协议各条款以及同意本协议的签署。各方通过上述方式签署本协议且各乙方同意出借资金总额达到甲方借款金额、丙方对本协议的签署程序、所涉内容进行复核并确认通过时，本协议即成立并将在本平台保存，各方均可查阅。
    </p>
    <p>
      2.3
      乙方在此授权丙方于本协议成立后将已充值/存入至甲方本平台账户（含乙方在丙方连通的网络交易资金存管系统开立的存管账户，如有，下同）的出借资金划至甲方在本平台账户（含甲方在丙方连通的网络交易资金存管系统开立的存管账户，如有，下同），完成本协议项下资金的出借；出借资金自划入甲方本平台账户之日开始计息（"起息日"）；同时，在资金出借完成后，甲方同意并授权丙方或推荐甲方的推荐机构将该笔出借资金通过第三方（第三方支付机构和/或金融机构）从甲方账户划拨至甲方指定提现的银行账户。因甲方指定提现的银行账户挂失或注销或者甲方指定提现的银行账户信息有误导致提现未能成功的，甲方确认按本协议第6条的约定做提前还款处理。
    </p>
    <h3>
      三、各方权利和义务
    </h3>
    <p>
      3.1 甲方的权利和义务
    </p>
    <p>
      3.1.1 甲方保证其向丙方提供的信息、资料均为真实、合法、有效，且不存在任何虚假、遗漏和隐瞒。
    </p>
    <p>
      3.1.2
      甲方保证借款用途真实、合法，不得用于投资股票、场外配资、期货合约、结构化产品及其他衍生品等高风险项目或用于向其他人出借，也不得将借款用于支付房屋买卖首付款；除按照本协议约定进行使用外，乙方不得将本协议项下之借款用于其他任何用途。
    </p>
    <p>
      3.1.3 甲方保证自身具有与借款金额向匹配的还款能力，并应当按期、足额向甲方归还每期应还本金和利息，以及按期、足额向丙方支付相关费用。
    </p>
    <p>
      3.1.4 甲方应确保向丙方如实提供其在所有网络借贷信息中介机构未偿还借款信息，并保证其在所有网络借贷信息中介机构平台借款总余额与本合同借款本金金额合计总额不超过人民币100万元。
    </p>
    <p>
      3.1.5 甲方保证在本协议履行过程中，及时向乙方、丙方如实报告影响或可能影响乙方权益的重大信息。
    </p>
    <p>
      3.1.6 甲方不得从事下列行为：
    </p>
    <p>
      （1）通过故意变换身份、虚构融资项目、夸大融资项目收益前景等形式的欺诈借款；
    </p>
    <p>
      （2）同时通过多个网络借贷信息中介机构，或者通过变化项目名称、对项目内容进行非实质性变更等方式，就同一融资项目进行重复融资；
    </p>
    <p>
      （3）在网络借贷信息中介机构以外的公开场所发布同一融资项目的信息；
    </p>
    <p>
      （4）法律法规和网络借贷有关监管规定禁止从事的其他活动。
    </p>
    <p>
      3.1.7 甲方有权了解其在丙方的信用评审进度及结果。
    </p>
    <p>
      3.1.8 除本协议另有约定，甲方不得将本协议项下的任何权利义务转让给任何其他方。
    </p>
    <p>
      3.1.9 本协议和法律法规规定的其他权利义务。
    </p>
    <p>
      3.2 乙方的权利和义务
    </p>
    <p>
      3.2.1乙方应保证其向本平台提供的信息、资料均为合法、真实、有效，不存在任何虚假、遗漏和隐瞒；同时，乙方保证其所用户出借的资金来源合法且是该资金的合法所有人，并非任何非法活动所得，也非汇集他人之资金或乙方受托管理之财产；如果第三人对资金归属、合法性问题发生争议，由乙方负责解决并自行承担相关责任；在该等争议解决（以取得生效的判决、裁决或行政命令、通知为标志）之前，丙方有权根据政府机关、司法机关或仲裁机关出具且生效的命令、判决、裁定或其他法律文件拒绝向乙方支付丙方带其领受的相关款项。
    </p>
    <p>
      3.2.2 乙方享有其所出借款项收产生的利息，并应自行承担和缴付就该等利息应缴付之税费（如有）。
    </p>
    <p>
      3.2.3 乙方确认已经了解资金出借的风险，确认具有相应的风险认知和承受能力，并自行承担借贷产生的本息损失；如甲方还款金额不足以涵盖其在本协议项下应付之全部款项的，乙方同意各自按照其借出款项比例收取还款。
    </p>
    <p>
      3.2.4 就任一乙方在本协议项下对甲方的部分或全部债权，任一乙方均有权根据自己的意愿对外转让。
    </p>
    <p>
      3.2.5 如甲方违反本协议项下对乙方负有的义务，乙方有权要求丙方提供其已获得的甲方信息、资料。
    </p>
    <p>
      3.2.6 乙方承诺对依据本协议获得的甲方信息、资料予以保密，除用于本协议目的进行资金出借与合理催收外，不得向外转让或披露。
    </p>
    <p>
      3.2.7 本协议和法律法规规定的其他权利义务。
    </p>
    <p>
      3.3 丙方的权利和义务
    </p>
    <p>
      3.3.1 丙方有权根据谨慎、合理的原则核实甲方的借款申请和甲方的信息、资料的真实性。
    </p>
    <p>
      3.3.2 丙方有权根据甲方提供的各项信息及丙方独立获得的信息评定甲方的个人信用等级，并根据对甲方个人信息的评审结果，决定是否审核通过并将甲方的借款需求向乙方进行推荐。
    </p>
    <p>
      3.3.3 丙方有权采取措施防范欺诈行为，发现欺诈行为或其他损害乙方、丙方利益的情形的，丙方有权进行公告并终止甲方在本平台的借贷活动。
    </p>
    <h3>
      四、委托授权
    </h3>
    <p>
      4.1
      乙方在此不可撤销地同意并确认，授权丙方作为其代理人，代理其行使其在本协议项下之各项权利，包括但不限于甲方（或其他主体代甲方）偿还的借款本息、按照本协议第8.6条规定宣布甲方未偿本息全部到期、向甲方进行借款的违约提醒及催收工作（包括但不限于电话通知、上门通知、发律师函、对甲方提起诉讼及仲裁等）；同时，乙方亦同时授权甲方的推荐方可对甲方进行签署宣布甲方未偿本息全部到期、借款违约提醒和催收工作；丙方与甲方推荐方均可以委托其他主体进行前述借款的违约提醒和催收工作。
    </p>
    <p>
      4.2 甲方在此不可撤销地同意并确认，授权推荐方与丙方作为其代理人为如下之行为：
    </p>
    <p>
      4.2.1
      根据甲方及其推荐方签署的《委托代扣款授权书》，划扣/接收甲方存入其指定之账户的资金并受托将该等资金划付至甲方或丙方（作为甲方的代理人），用以偿付本协议项下甲方应付之各项款项；具体支付事宜以《委托代扣款授权书》约定为准；丙方特此提示甲方，就甲方推荐方受甲方委托代为划扣/接收甲方还款事宜，存在甲方已将还款交予推荐方，但是推荐方未按照本协议约定向甲方或丁方（代理甲方）进行转付的风险，甲方对此等风险已知晓并同意自行承担相应风险。
    </p>
    <p>
      4.2.2 代甲方受领乙方、丙方向甲方发出之各项通知。但推荐方并不承担因为甲方未及时更新其通讯信息、恶意逃避推荐方发出之各项通知导致的任何经济和法律责任，该等经济和法律责任均由甲方自行承担。
    </p>
    <p>
      4.3 各方在此同意并确认，尽管有协议4.2条之约定，除本协议另有约定外，甲方之推荐方对于甲方在本协议项下应付之任何款项，推荐方均不承担任何偿付责任；当甲方发生违约时，乙方、丙方应当直接向甲方主张违约责任。
    </p>
    <h3>
      五、本息偿还方式
    </h3>
    <p>
      5.1 甲方必须按照本协议的约定按时、足额偿还对乙方的本金和利息。
    </p>
    <p>
      5.2 甲方授权丙方按本协议约定还款时间代扣甲方交易结算资金管理账户或银行结算账户中的余额以向乙方支付应还本金和利息。为此，甲方应保证在还款日当日的甲方交易结算资金管理账户或银行结算账户中余额足以支付当期应付利息或本金。
    </p>
    <p>
      5.3 甲方授权丙方委托其指定的支付机构按还款计划将金额等同于乙方当期月偿还本息数额的资金于约定日期划转至乙方交易结算资金管理账户内，划转完毕即视为本期还款支付成功。
    </p>
    <p>
      5.4 还款日不受法定假日或公休日影响，还款日或还款期截止必须还款。
    </p>
    <p>
      5.5 逾期还款或者违约情形下，甲方还款顺序依次为违约金、逾期违约金、罚息、利息、本金。
    </p>
    <p>
      5.6 如遇到还款当月无还款日对应日的月份，还款日为应还款当月的最后一日。
    </p>
    <p>
      5.7
      甲方应在本协议项下还款日清偿应还借款本息及相关费用（如有），如甲方未能按时偿还，则视为甲方逾期。如果甲方未或者未能按照第4.2.1条约定以及其与推荐方之《委托代扣款授权书》等协议约定按期、足额将应还本息支付至指定账户并将导致甲方逾期的，丙方有权安排第三方对甲方应还款项进行垫付。乙方在此不可撤销的同意并确认，如果有第三方接受丙方安排代甲方支付了应还款项，则乙方承诺接受该等垫付；同时，乙方确认，第三方完成垫付后，甲方在本协议项下相应义务视为履行完毕，乙方对甲方享有之相应债权（包括债权本息、罚息）即自动转让给该等垫付的第三方。
    </p>
    <h3>
      六、提前还款
    </h3>
    <p>
      6.1 甲方可在借款期间任何时候通过本平台的"提前还款"功能提前偿还剩余借款。
    </p>
    <p>
      6.2 若甲方提前偿还借款，以实际用款时间据实结算利息（根据相关合同约定计算）。
    </p>
    <h3>
      七、逾期还款
    </h3>
    <p>
      7.1 任一还款日当日，甲方交易结算资金管理账户或银行结算账户余额不足以支付应还款的，则视为逾期。
    </p>
    <p>
      7.2
    </p>
    <p>
      （1）甲方同意在偿还每期借款利息与本金时支付相关费用（包括但不限于违约金、罚息等），相关费用计算方式如下：
      说明：罚息=当前逾期本金*逾期天数*0.098%
      例如：用户在1月1日借款10000元，分3期还款，还款计划如下：
    </p>
    <table border="1">
      <thead>
      <tr>
        <th>期数</th>
        <th>还款日</th>
        <th>本金</th>
        <th>利息</th>
        <th>服务费</th>
        <th>总还款额</th>
      </tr>
      </thead>
      <tbody>
      <tr>
        <th>第一期</th>
        <td>2月1日</td>
        <td>3235.34</td>
        <td>120.00</td>
        <td>179.90</td>
        <td>3535.24</td>
      </tr>
      <tr>
        <th>第二期</th>
        <td>3月1日</td>
        <td>3332.36</td>
        <td>81.18</td>
        <td>121.70</td>
        <td>3535.24</td>
      </tr>
      <tr>
        <th>第三期</th>
        <td>4月1日</td>
        <td>3432.30</td>
        <td>41.19</td>
        <td>61.75</td>
        <td>3535.24</td>
      </tr>
      </tbody>
    </table>
    <p>
      ①、用户在2月1日未还款，逾期未到3月1日时，对其催收第一期（本金+利息+服务费+罚息）。
    </p>
    <p>
      ②、用户在2月1日未还款，至3月1日仍未还款（含3月1日当天），对其催收第一期（本金+利息+服务费+罚息）、第二期（本金+利息+服务费）、第三期（本金）。
    </p>
    <p>
      ③、用户在2月1日未还款，至4月1日仍未还款（含4月1日当天），对其催收第一期（本金+利息+服务费+罚息）、第二期（本金+利息+服务费+罚息）、第三期（本金+利息+服务费）。
    </p>
    <p>
      ④、用户在2月1日未还款，至4月1日后仍未还款，对其催收第一期（本金+利息+服务费+罚息）、第二期（本金+利息+服务费+罚息）、第三期（本金+利息+服务费+罚息）。
    </p>
    <p>
      （2）如果一期借款逾期至下一个还款日仍未还款，须将剩余所有未还本金一次性偿还，但对所有到期已产生的费用不予免除。
    </p>
    <p>
      7.3  借款期间内，逾期违约金可根据本平台相关规则的变化进行相应调整。如相关规则发生变化，则本平台会在网站公示该等规则的变化。
    </p>
    <p>
      7.4  逾期产生的逾期违约金不计利息。
    </p>
    <h3>
      八、债务转让
    </h3>
    <p>
      8.1 未经乙方的事先书面（包括但不限于电子邮件等方式）同意，甲方不得将本协议项下的任何权利义务转让给任何第三方。
    </p>
    <h3>
      九、债权转让
    </h3>
    <p>
      9.1 任一乙方均有权将其在本协议项下对甲方享有的债权之全部或部分向其他任何一个或多个主体进行转让（下称"债权转让"）；但乙方应当在本平台，通过点击操作从而形成电子合同的形式进行转让。乙方进行债权转让的，受让人同时受让乙方在本协议项之各项权利、义务并受本协议项下各条款之约束。受让人在本平台点击确认受让乙方债权的，受让人信息以及债权转让信息均以《债权转让协议》约定展现，且该协议构成本协议之有效补充。
    </p>
    <p>
      9.2 乙方进行债权转让的，该等转让信息将在乙方本平台账户显示；该等债权转让通知一经在乙方本平台账户显示，即视为乙方已将债权转让事宜通知甲方，甲方不以任何理由对此提出异议或抗辩。
    </p>
    <p>
      9.3 乙方同意授权丙方将前述债权转让信息向甲方之推荐方披露，并同意推荐方可以书面（包括电子邮件）或口头形式再次向甲方通知债权转让事宜。
    </p>
    <h3>
      十、违约
    </h3>
    <p>
      10.1  下述情形视为甲方严重违约
    </p>
    <p>
      10.1.1  甲方擅自改变本协议第一条规定的借款用途；
    </p>
    <p>
      10.1.2  未经乙方书面同意擅自转让本协议项下借款债务的；
    </p>
    <p>
      10.1.3  甲方提供虚假资料或者故意隐瞒重要事实等导致或者可能导致乙方期待利益无法实现或合同目的无法实现等严重后果的违约行为；
    </p>
    <p>
      10.1.4  导致乙方、丙方有合理理由认为甲方严重违反合同义务的其他行为。
    </p>
    <p>
      10.2  甲方严重违约情形下乙方有权提前终止本协议，宣告借款提前到期，同时，甲方应向乙方支付借款本金总额10%的金额作为违约金，甲方应在乙方宣告借款提前到期后的三日内，向乙方一次性支付余下的所有本金、利息、罚息和违约金，三日期限届满日当日未能完成还款的视为逾期，依照本协议第八条相关约定支付罚息。
    </p>
    <p>
      10.3  甲方应将上述款项支付至甲方交易结算资金管理账户或银行结算账户，由丙方代乙方划转至乙方交易结算资金管理账户。
    </p>
    <p>
      10.4  乙方在此不可撤销地授权丙方代为行使本协议约定的单方终止协议的权利，即在8.1条约定严重违约事由发生或发现后，丙方有权代乙方行使单方终止协议的权利并提示、敦促甲方履行8.2条约定的付款义务。
    </p>
    <p>
      10.5  丙方保留将甲方违约失信的相关信息提供给征信机构和在媒体披露的权利。
    </p>
    <p>
      10.6  因甲方未依约履行还款义务而导致各方发起维权行为产生费用将由甲方承担，包括但不限于调查费、交通费、误工费、诉讼费及律师代理费等。
    </p>
    <p>
      10.7  甲方违约行为构成犯罪的，本协议各方均将有权向相关国家机关报案，追究甲方刑事责任。
    </p>
    <h3>
      十一、信息保护与披露
    </h3>
    <p>
      11.1 各方在此确认，为保护甲方/乙方隐私而对甲方/乙方真实身份在本协议项下的隐藏/部分银行，并不对甲方和乙方真实意思的表示、本协议的有效性产生任何影响，各方也不得以此为由拒绝履行本协议。甲方和乙方在此承诺妥善保管自己在本平台账户信息，并应当自行承担因本平台账户的注册用户名和密码丢失、泄露或允许他人使用所产生的后果。通过甲方/乙方本平台用户名和密码登录而在本平台账户下的任何操作均视为由甲方/乙方本人的操作并代表甲方/乙方本人的真实意思表示，且甲方/乙方受该等操作项下签署的各项法律文件之约束，对此甲方、乙方不得以其他任何理由提出异议或抗辩。
    </p>
    <p>
      11.2 对于各乙方而言，丙方按照本平台用户注册协议（包括其有效修订和补充，下同）使用、披露其各项信息、资料；对于甲方而言，丙方有权配合乙方行使本协议项下各权利，向乙方提供甲方之各项信息、资料。丙方与甲方之推荐方将妥善保管出借人和借款人的资料和交易信息，不得删除、篡改，不得非法买卖、泄露出借人和借款人的基本信息和交易信息。
    </p>
    <h3>
      十二、争议与解决
    </h3>
    <p>
      12.1  本协议有关的一切争议，均提请衢州仲裁委员会仲裁，并适用其网络仲裁规则（包括适用互联网金融仲裁特别规定条款），衢州仲裁委员会的裁决为终局裁决，对双方具有法律约束力。
    </p>
    <p>
      用户确认以<u class="sign">{{emailAddress?emailAddress:'________________'}}</u>为联络邮箱，为双方之间及涉诉纠纷相关材料送达地址；并以<u class="sign">{{phone?phone:'________________'}}</u>为联络手机号码，为短信通知号码。按本协议约定由任何一方发给其他方的任何通知，应以电子邮件或者短信等形式发出，送至约定邮箱或者手机号码。收件人指定系统接受材料或通知之日，即视为送达和收到之日。如一方需变更联络邮箱或者手机号码的，应当书面通知并得到对方确认。
    </p>
    <p>
      12.2  乙方在此不可撤销地委托丙方代为处理本协议项下乙方与甲方之间的全部争议，委托代理权限包括但不限于代为提出、承认、变更、撤回、放弃仲裁请求；代为进行答辩，提出、承认、变更、撤回、放弃仲裁反请求；代为约定仲裁庭组成方式、选定仲裁员；参加开庭审理、陈述事实及代理意见并参加调查、质证活动；接受调解、和解；代为领取仲裁文书及仲裁标的。并且，乙方同意丙方可将前述委托事项转委托给专业机构及人员（如律师事务所、律师等）启动仲裁程序。
    </p>
    <h3>
      十三、其他
    </h3>
    <p>
      13.1  本协议经甲乙双方通过本平台以网络在线点击的方式签订。
    </p>
    <p>
      13.2  各方确认，就丙方为甲乙双方借款关系的达成所提供的居间服务，不表明或暗示为债权及债务法律关系的一方，相关风险由交易各方自行承担。
    </p>
    <p>
      13.3  本协议项下税费由交易各方自行承担。
    </p>
    <p>
      13.4  展示募集期限届满但甲方拟借款金额未能全部冻结的，甲方有权拒绝接受当时已冻结资金，甲方拒绝的，本协议自动终止；甲方将本协议下全部本金、利息、违约金及其他相关费用全部偿还完毕之时，本协议亦自动终止。
    </p>
    <p>
      13.5  本协议的任何修改、补充均须以本平台电子文本形式作出。
    </p>
    <p>
      13.6  各方均确认，本协议的签订、生效和履行以不违反法律为前提。如果本协议中的任何一条或多条违反适用的法律，则该条将被视为无效，但该无效条款并不影响本协议其他条款的效力。
    </p>
    <p>
      13.7  各方委托本平台保管所有与本协议有关的书面文件或电子信息。
    </p>
    <p>
      13.8  本协议中所使用的定义，除非另有规定，否则应适用本平台释义规则，本平台对本文定义享有最终解释权。
    </p>
    <p>
      （以下无正文）
    </p>
    <p>
      甲方：<u class="sign">{{userName}}</u>
    </p>
    <p>
      <u class="sign">{{authTime}}</u>
    </p>
    <p>
      乙方：<u class="sign">{{userNameB}}</u>
    </p>
    <p>
      <u class="sign">{{authTime}}</u>
    </p>
    <p>
      丙方：<u class="sign">{{userNameC}}</u>
    </p>
    <p>
      <u class="sign">{{authTime}}</u>
    </p>
  </div>
</template>

<script>
  export default {
    name: "loan-agreement",
    data() {
      return {
        protocolID: this.$route.query.protocolID,
        userName: this.$route.query.userName,
        userNameB: this.$route.query.userNameB,
        userNameC: this.$route.query.userNameC,
        idNo: this.$route.query.idNo,
        idNoB: this.$route.query.idNoB,
        loanUsage: this.$route.query.loanUsage,
        amount: this.$route.query.amount,
        fee: this.$route.query.fee,
        limitDate: this.$route.query.limitDate,
        startPDL: this.$route.query.startPDL,
        startAmount: this.$route.query.startAmount,
        endAmount: this.$route.query.endAmount,
        stagesMonth: this.$route.query.stagesMonth,
        repayMethod: this.$route.query.repayMethod,
        repayStart: this.$route.query.repayStart,
        repayDate: this.$route.query.repayDate,
        authTime: this.$route.query.authTime,
        phone: this.$route.query.phone,
        emailAddress: this.$route.query.emailAddress
      }
    },
    mounted() {
      document.title = '借款协议'
    }
  }
</script>

<style scoped lang="less">
  .protocol {
    width: 100%;
    display: flex;
    flex-direction: column;
    justify-content: center;
    align-items: center;
    font-size: 0.28rem;
    line-height: 0.42rem;
    padding-bottom: 1rem;

    .sign {
      color: #45403d;
      font-weight: bolder;
    }

    p {
      width: 92%;
      margin-top: 0.32rem;
    }

    h3 {
      width: 92%;
      margin-top: 0.6rem;
    }

    h2 {
      width: 92%;
      line-height: 0.8rem;
      margin-top: 0.3rem;
    }
    table {
      width: 92%;
      margin-top: 0.32rem;
    }
  }
</style>
