<template>
  <div class="protocol">
    <h3>
      用户授权协议
    </h3>
    <p>
      《用户授权协议》(以下简称"本协议")是富银弘远（厦门）信息科技有限公司（以下简称"富银弘远"，运营平台"富卡"）与用户（以下简称"您"）所订立的有效合约。您通过网络页面点击确认或以其他方式选择接受本协议，即表示您与富卡已达成协议并同意接受本协议的全部约定内容。
    </p>
    <p>
      在接受本协议之前，请您仔细阅读本协议的全部内容（特别是以粗体下划线标注的内容）。如您不同意本协议的内容，或无法准确理解本协议任何条款的含义，请不要进行确认及进行后续操作，一旦确认即视为您同意本协议全部内容。如果您对本协议有疑问的，请通过400-080-8012（此处请填写客服电话）进行询问，其将向您解释。
    </p>
    <p>
     <b> 1、您授权本网站采用电子合同的方式在本网站平台与您签订您与本网站平台进行交易需订立的协议，该协议可以有一份或者多份并且每一份具有同等法律效力。</b>您或您的代理人根据有关协议及本网站的相关规则在本网站确认签署的电子合同即视为您本人真实意愿并以您本人名义签署的合同，具有法律效力。<b>您应妥善保管自己的账户密码等账户信息，</b>您通过前述方式订立的电子合同对合同各方具有法律约束力，您不得以账户密码等账户信息被盗用或其他理由否认已订立的合同的效力或不按照该等合同履行相关义务。
    </p>
    <p>
      <b>
        2、您确认在签署文件之前已经仔细阅读过文件的相关内容并予以理解和接受，您认可您通过本网站签署的电子合同条款的相关内容。
      </b>
    </p>
    <p>
      <b>3、您根据本协议以及本网站的相关规则签署电子合同后，不得擅自修改该合同。</b>本网站向您提供电子合同的保管查询、核对等服务，如对电子合同真伪或电子合同的内容有任何疑问，您可通过本网站的相关系统板块查阅有关合同并进行核对。如对此有任何争议，应以本网站记录的合同为准。
    </p>
    <p>
      <b>
        4、您认可您在签订电子合同过程中提交的实名认证资料，并同意通过包括但不限于短信验证码、活体认证、芝麻授权、运营商授权、通讯录授权等方式进行意愿认证，以及认可因上述操作产生的电子证据；若因合同履行产生纠纷，就合同签订过程中产生的电子证据您不得提出异议，该证据可直接作为纠纷处理依据。
      </b>
    </p>
    <p>
      5、本协议未尽事宜，参照《用户注册登录协议》执行；《用户注册登录协议》与本协议有冲突的，以本协议为准。
    </p>
    <p>
      6、本协议有关的一切争议，均提请衢州仲裁委员会仲裁，并适用其网络仲裁规则（包括适用互联网金融仲裁特别规定条款），衢州仲裁委员会的裁决为终局裁决，对双方具有法律约束力。
    </p>
    <p>
      用户确认以<u class="sign">{{emailAddress?emailAddress:'________________'}}</u>为联络邮箱，为双方之间及涉诉纠纷相关材料送达地址；并以<u class="sign">{{phone?phone:'________________'}}</u>为联络手机号码，为短信通知号码。按本协议约定由任何一方发给其他方的任何通知，应以电子邮件或者短信等形式发出，送至约定邮箱或者手机号码。收件人指定系统接受材料或通知之日，即视为送达和收到之日。如一方需变更联络邮箱或者手机号码的，应当书面通知并得到对方确认。
    </p>
  </div>
</template>

<script>
  export default {
    name: "user-authorization",
    data() {
      return {
        phone: this.$route.query.phone,
        emailAddress: this.$route.query.emailAddress,
      }
    },
    mounted() {
      document.title = '用户授权协议'
    }
  }
</script>

<style scoped lang="less">
  .protocol {
    width: 100%;
    display: flex;
    flex-direction: column;
    justify-content: center;
    align-items: center;
    font-size: 0.28rem;
    line-height: 0.42rem;
    padding-bottom: 1rem;

    .sign {
      color: #45403d;
      font-weight: bolder;
    }

    p {
      width: 92%;
      margin-top: 0.32rem;
    }

    h3 {
      width: 92%;
      margin-top: 0.6rem;
    }

    h2 {
      width: 92%;
      line-height: 0.8rem;
      margin-top: 0.3rem;
    }
  }
</style>
