<template>
  <div class="protocol">
    <h3>
      用户注册登录协议
    </h3>
    <p>
      合同编号：
    </p>
    <p>
      欢迎使用“富卡”，“富卡”及移动端应用软件平台，（以下可称“本平台”）是由富银弘远（厦门）信息科技有限公司研发、管理、自主经营的，可为具有信用类借款或消费分期需求的用户（本协议中“用户”特指依据本注册协议规定注册并使用“富卡”的个人）提供小微金融信息咨询、信息交互、资金对接、贷后信用管理等移动互联网小微金融信息技术服务。</p>
    <h3>一、富卡注册限制及使用说明</h3>
    <p>第一条
      为了保障您的权益，请于注册或使用本平台服务前，仔细阅读并完全理解本协议条款的全部内容，<b>其中用粗字体予以标注的，是与您的权益具有或可能具有重大关系，及对本公司具有或可能具有免责或限制责任的条款，请您特别注意。</b>用户只有成功注册成为富卡用户后，才能使用本平台服务。当用户完成注册程序即视为其同意不加修改地无条件完全接受本协议所包含的条款、条件和本平台已经发布的或将来可能发布的各类规则，并且遵守有关互联网及/或本平台的相关法律、法规与规则，如用户不同意本协议的任意内容，请勿注册或使用本平台。根据《中华人民共和国合同法》，如用户通过进入注册程序并点击相应确认按钮，即表示该用户与富银弘远（厦门）信息科技有限公司已订立本协议，自愿接受本协议的各项条款；此后，用户不得以未阅读本服务条款内容做任何形式的抗辩，也不得以未签署书面协议为由否认本协议的效力。
    </p>
    <p>
      <b>
        第二条 本平台运营方有权随时修改本协议条款，并只需公示于本平台，而无需征得用户事先同意。修改后的条款于公示时即时生效。在本平台修改本协议条款后，用户继续使用服务应被视作已接收修改后的条款。
      </b>
    </p>
    <p>
      <b>
        第三条 本平台保留在中华人民共和国大陆地区施行之法律允许的范围内单方决定拒绝提供本平台服务、关闭用户账户、清除、编辑内容、停止用户对本平台部分或全部功能的使用。
      </b>
    </p>
    <p>
      <b>
        第四条 本协议约定不涉及用户与本平台的其他用户之间因网上交易而产生的法律关系及法律纠纷。
      </b>
    </p>
    <p>
      <b>
        第五条
        本平台只接受持有中国大陆有效身份证的（不包括香港特区、澳门特区及台湾地区）18周岁以上的具有完全民事行为能力的自然人注册成为平台用户。如不具备上述资格，应立即停止在本平台的注册程序、停止使用本平台的服务，本平台有权随时终止注册进程及本平台服务，否则相应注册行为给本平台带来的损失由注册人承担全额赔偿责任，且注册人的监护人（如该注册人为限制民事行为能力的自然人）应承担连带赔偿责任。
      </b>
    </p>
    <p>
      第六条
      在注册时和使用本平台服务的所有期间，用户应提供自身真实、有效及完整的信息资料并保证自注册之时起至用户使用本平台服务的所有期间，其所提交的所有资料和信息（包括但不限于电子邮件地址、联系电话、联系地址、邮政编码、个人身份信息）的有效性。如果用户提供的注册资料不合法、不真实、不准确、不详尽的，用户本人需承担因此引起的相应责任及后果，并且本平台保留终止用户继续使用本平台各项服务和要求赔偿相应损失的权利。
    </p>


    <h3>二、第二章 服务内容范围及说明</h3>
    <p>
      第七条 用户成功注册成为本平台用户后，可通过其本人设置的用户名和密码登录并使用本平台服务，具体以本平台公布的服务内容为准。
    </p>
    <p>
      第八条 本平台就向用户提供的服务收取相应的服务费，服务费具体标准和规则以本平台公布的收费标准为准，或者由本平台运营方或/及提供相关服务的第三方（简称"第三方服务提供商"）与用户另行签署其他协议方式确定。
    </p>
    <p>
      第九条
      富卡为用户提供信息发布服务。用户承诺，其通过富卡平台上传或发布的任何资料信息均真实有效。如因违背上述承诺，造成的任何法律后果，用户都将自行承担责任。此外，用户有义务及时更新个人信息资料。如因未及时更新个人信息资料，导致本平台无法正常提供服务时，平台方不承担任何责任，所有后果应由用户个人承担。
    </p>
    <p>
      第十条
      富卡为用户提供信息咨询、信用评定服务。用户不可撤销同意，本平台可自行或通过第三方（包括且不限征信机构）采集、保存、整理用户的个人信息和额外信息，以了解用户的实际情况。富卡有权根据该实际情况对用户信息进行评价并以此确定用户作为借款人时平台审核评定的信用额度。
    </p>
    <p>
      该信用额度代表用户信息经本平台审核通过后由富卡提供的小微金融信息服务从本平台或合作方平台出借人处获得的借款款项最大限额、用户从富卡指定合作的其他电子商务类平台获得相应商品或服务时可申请消费类赊购款项的最大额度及用户对本人实名信用卡未还款项通过本平台或合作方平台出借人借款代为偿还的最大限额。用户注册和使用平台服务期间根据平台对其信用状况评定的额度范围内可随时申请并获取信用借款及/或消费类借款及/或信用卡代偿款项的同时须签署或确认相应借款类交易合同文本及于平台之间相应的服务类合同文件并确认按上述合同文件约定按时足额履行偿还本金、支付利息及支付平台或相应方服务费用等义务。如用户履行完毕上述相应义务，其已使用并偿还的借款（本金）额度可即时恢复并继续循环使用；如用户未完全或拒绝履行上述相应义务或发生其他危害、损害出借人或平台人利益及权益等违约行为，则平台有权变更、降低、取消用户相应信用额度的同时要求用户提前清偿全部借款本金及利息、支付逾期管理服务费及违约金、采取诉讼、仲裁等司法方式要求用户承担因违约而带来的不利后果及给相应方造成的任何损失。
    </p>
    <p>
      第十一条
      富卡为用户提供交易管理服务。本平台提供的各种交易信息及资料仅供用户参考，用户应考虑实际情况独立判断并作出交易决策。用户应知悉投资风险，交易发生后产生的一切风险均由用户自行承担。此外，如果本平台发现了因系统故障或其他任何原因导致的处理错误，本平台均有权纠正该错误，用户有义务根据平台方发布的有关纠错的通知进行相应操作。
    </p>
    <p>
      第十二条
      富卡为用户提供合同管理服务。本平台交易时订立的合同采用电子合同方式，并保存在本平台（或指定的第三方平台）为此设立的专用服务器中，任何信息从富卡发出时起，即视为已告知用户，用户不得以任何理由否认合同的效力或拒绝履行合同中规定的义务。
    </p>
    <p>
      第十三条
      富卡为用户提供借款回收的管理服务。用户从本平台申请并获取相应借款后，本平台根据用户实际借款金额、借款期限及借款利率，确定并告知用户每月还款金额、相应还款日及期数。任何信息从本平台发出起，即视为已告知用户，用户不得以任何理由否认合同的效力或拒绝履行合同中规定的义务。如用户产生拒绝承认借款事实、逃避还款责任、逾期或未足额支付全部还款款项等情形，出借人不可撤销同意并授权本平台或平台合作方采用电话通知、函件、上门催收等合理方式对用户进行借款回收的管理服务，由此给用户个人带来的任何不利影响及造成的不利后果均由用户本人承担。
    </p>
    <p>
      第十四条
      用户在此认可并同意基于提供上述服务的目的，本平台有权联合或推荐第三方服务提供商向用户本人提供具体服务项目。如用户对本平台合作的第三方服务提供商存在任何异议，请停止使用相关服务，如用户未停止使用相关服务或用户在交易服务类相关文件签署或确认等行为均将视为其认可并接受由该第三方服务提供商为其提供相关服务。用户使用本平台服务过程中与本平台或/及第三方服务提供商之间的权利义务关系取决于用户本人接受相关服务前确认的相应服务协议条款约定。
    </p>
    <p>
      第十五条
      用户知悉并认可，尽管本平台对第三方服务提供商进行了严格的甄选，但不能控制及保证第三方服务提供商全部信息的真实性、合法性、准确性、有效性，亦不能控制或保证所涉及产品或服务的质量，以及第三方服务提供商履行在相应服务协议项下各项义务的资质或能力。
    </p>
    <h3>
      三、使用须知
    </h3>
    <p>
      第十六条 用户不得利用本平台或本平台服务从事任何不符合中国法律法规或侵犯他人权益的活动。本平台在发现用户从事该等活动时，有权不经通知而立即停止用户对本平台的全部或部分功能的使用。
    </p>
    <p>
      第十七条
      在使用本平台提供的任何服务的过程中，用户不得发送、发布或展示任何垃圾、广告推销邮件、信息或其他可能违反中国法律法规及本协议的内容。本平台在发现用户从事该等活动或发布该等内容时，有权不经用户本人同意而直接删除该等内容，并有权不经通知而立即暂停或停止用户对本平台的全部或部分功能的使用。
    </p>
    <p>
      <b>
        第十八条
        用户在注册时向本平台提交的手机号码、电子邮箱、用户名、密码是用户本人在本平台的唯一识别信息。用户注册成功后应妥善保管，不得将注册的相关信息转让或授权给第三方使用，如果本平台发现同一账户和密码在同一时间内被多人同时登录使用，本平台有权暂停、终止或限制该用户访问直至取消该用户的用户资格，并不予任何赔偿或者退还任何已收取的服务费用。同时，用户确认，使用其本人的用户名和密码登录本平台后在本平台的一切行为均视为代表用户本人意志并由本人承担相应的法律后果。如用户因忘记密码或密码被盗向本平台查询密码时，必须提供完全、正确的注册信息，否则本平台有权本着为用户保密的原则不予告知。
      </b>
    </p>
    <p>
      <b>
        第十九条
        用户发现有他人冒用或盗用本人的用户名及密码或任何其他未经合法授权之情形时，应立即以有效方式通知本平台，要求暂停相关服务。同时，用户理解本平台对本人的请求采取行动需要合理期限，而在本平台采取实际行动之前，用户应对任何或所有由未经授权人士使用此服务或此服务被用作未经授权用途负责，本平台对已执行的指令及（或）所导致的用户本人的损失不承担任何责任。
      </b>
    </p>
    <p>
      <b>
        第二十条
        在本协议的履行过程中，用户有义务配合完成本平台相关操作。如因网络技术故障、用户误操作等原因导致发生异常状况或用户对本平台提供的服务存有疑问时，用户须及时与本平台取得联系并说明上述情况，否则因此造成的一切损失均由用户个人承担。
      </b>
    </p>
    <p>
      第二十一条 用户保证合法使用本平台提供的咨询或服务，遵守所有与本平台服务有关的协议、规则和程序。未经本平台运营方事先书面授权，不适用任何非法手段擅自进入本平台的未公开系统。
    </p>
    <p>
      第二十二条
      用户同意并理解，在成为本平台用户后，本平台有权通过手机短信、电子邮件、网页或其他合法方式向用户发送本平台服务的信息或其他相关商业信息。用户在使用电信增值服务的情况下，本人同意接受本平台及合作公司通过增值服务系统或其他方式向本人发送相关服务信息或其他信息，其他信息包括但不限于通知信息、宣传信息、广告信息等。
    </p>
    <h3>
      四、征信及信息披露授权
    </h3>
    <p>
      第二十三条 采集授权
    </p>
    <p>
      1.用户同意并不可撤销的授权本平台采集、保存本人与其业务往来中提供或产生的个人信息，并向中国人民银行金融信用信息基础数据库及/或其他经批准成立的征信机构及/或与被授权方具有合作关系的第三方（为方便表述，上述机构以下统称"征信机构"，与被授权方具有合作关系的第三方，以下可单独称为"本平台合作方"）提供用户本人个人信息和包括信贷信息在内的信用信息（含不良信用信息）。
    </p>
    <p>
      2.用户特别授权本平台直接或间接地向征信机构提供不良信用信息前，无需另行通知用户本人，本平台亦可自行决定选择以电子邮件、短信、纸质信件等任一方式通知本人。当用户联系信息变更时，需要及时更新，确保及时收到通知。若用户未及时更新，其之前留存的联系方式视为有效联系方式，通过该联系方式通知用户时，即视为有效送达用户本人。但是，依照法律、行政法规规定公开的不良信息除外。
    </p>
    <p>
      3.用户知悉在信息安全保障制度不完善的情况下，对外提供个人收入、存款、有价证券、商业保险、不动产的信息和纳税数额信息可能产生信息泄露等不良影响，用户本人同意授权本平台向征信机构提供前述财产性信息。
    </p>
    <p>
      第二十四条 使用授权及信息披露
    </p>
    <p>
      1.用户同意授权征信机构在保证本人信息安全的前提下，保存、整理、加工第二十三条中所述的、通过合法途径采集的用户本人的个人信息，并向中国境内的其他信息使用者提供。
    </p>
    <p>
      2.用户同意授权本平台自行或通过本平台合作方向征信机构查询、打印、保存用户本人被征信机构合法采集、整理或加工产生的其他信息提供方提供的本人个人信息和包括信贷信息在内的信用信息。
    </p>
    <p>
      3.用户同意授权本平台通过征信机构向其他拥有合法资质的第三方（包括但不限于其他拥有合法资质的征信机构、运营商及其代理商等）查询或核实本人信息，并同意本平台及征信机构将查询获取的信息进行打印、保存、整理、加工，并用于评价本人信用情况或核实本人信息的真实性。但法律、法规、监管政策禁止查询的除外。
    </p>
    <p>
      4.用户因与本平台合作方处申请相关业务或存在某种服务关系，本平台合作方可使用、保存、整理、加工本平台向其提供的用户本人征信及信用信息，并可自行通过征信机构向其他拥有合法资质的第三方（包括但不限于其他拥有合法资质的征信机构、运营商及其代理商等）查询或核实个人信息，并将该等信息与本平台进行共享。用户同意本平台合作方与本平台同等授权范围内进行上述信息采集、使用、披露行为且该行为已征得用户本人同意，无须另行书面授权。
    </p>
    <p>
      5.用户同意授权本平台及征信机构将合法获取的本人信息披露或运用于为其本人提供的下述业务中，包括：
    </p>
    <p>
      （1）对本人或配偶提出的〖贷款、租赁、赊购、投保、理赔、担保、投资〗等业务的事前、事中、事后情况进行审查；
    </p>
    <p>
      （2）对本人担任法定代表人、出资人或主要经营负责人的法人或其他组织的贷款或该法人或其他组织作为担保人，需要查询本人信息状况的；
    </p>
    <p>
      （3）对用户本人提出的异议申请进行核查；
    </p>
    <p>
      （4）向本人推荐产品及服务；
    </p>
    <p>
      （5）依法或经有权部门要求的（包括但不限于公检法机关需要、会计事务所审计、信息安全测评认证机构进行测评认证等）；
    </p>
    <p>
      （6）其他经过本人同意的合法用途。
    </p>
    <p>
      6.如用户决定选择或接受本平台、本平台合作方的相关产品及服务时，用户本人即不可撤销同意本平台对本人相关信息在本平台或本平台合作方平台进行合法披露，披露内容包括但不限于以下信息：
    </p>
    <p>
      （1）用户基本信息（包括但不限于年收入、主要财产、主要债务、信用报告）；
    </p>
    <p>
      （2）用户选择的产品项目或服务的基本信息（包括但不限于项目或服务名称、类型、主要内容、审批文件、还款来源、借款用途、借款金额、借款期限、还款方式及利率）；
    </p>
    <p>
      （3）本平台及/或合作方根据用户本人基本信息、征信包括财产状况等综合评定的信用评级或者信用评分；
    </p>
    <p>
      （4）在产品或服务履行期限内用户经营状况及财务状况、还款能力变化情况等；
    </p>
    <p>
      （5）其他因服务需要合法获取的信息、数据等。
    </p>
    <p>
      7.用户不可撤销地授权本平台将本人自行提供或本平台采集的基本信息、征信信息、融资信息、交易记录以及其他信息向监管机关、行业协会（包括但不限于：中国互联网金融协会、北京市网贷行业协会等）进行数据共享、披露。监管机关、行业协会可依据本授权将上述信息用于行业信息共享系统的建设、使用以及其他合法用途。
    </p>
    <h3>
      五、用户承诺和保证
    </h3>
    <p>
      第二十五条 本平台用户应保证严格遵守中国现行法律、法规、政府规章及其他应该遵守的规范性文件，不在本平台从事危害国家安全、洗钱、套现、传销等任何违法活动或者其他有违社会公共利益或公共道德的行为。
    </p>
    <p>
      <b>
        第二十六条 用户确认在签署本协议之前已阅读包括但不限于以下与本协议及相关协议的订立及履行有关的风险提示，并对该等风险有充分的理解和预期，用户本人自愿承担该等风险可能给带来的一切责任和损失：
      </b>
    </p>
    <p>
      1.政策风险：国家因宏观政策、财政政策、货币政策、行业政策、地区发展政策等因素引起的系统风险；
    </p>
    <p>
      2.不可抗力：由于本平台及相关第三方的设备、系统故障或缺陷、病毒、黑客攻击、网络故障、网络中断、地震、台风、水灾、海啸、雷电、火灾、瘟疫流行病、战争、恐怖主义、敌对行为、暴动、罢工、交通中断、停止供应主要服务、电力中断、经济形势严重恶化或其他类似事件导致的风险。
    </p>
    <h3>
      六、用户依法言行义务
    </h3>
    <p>
      第二十七条 用户同意严格遵守国家法律、法规、规章制度，严禁利用或针对本平台从事违法违规行为，包括但不限于：
    </p>
    <p>
      1.不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；
    </p>
    <p>
      2.从中国大陆向境外传输资料信息时必须符合中国有关法律、法规；
    </p>
    <p>
      3.不得利用本平台从事恐怖融资、窃取商业秘密、窃取个人信息等违法犯罪活动；
    </p>
    <p>
      4.不得干扰本平台的正常运转，不得侵入本平台及国家计算机信息系统；
    </p>
    <p>
      5.不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的、淫秽的、不文明的信息资料；
    </p>
    <p>
      6.不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；
    </p>
    <p>
      7.不得教唆他人从事本条所禁止的行为；
    </p>
    <p>
      8.不得利用在本平台注册的账户进行牟利性经营活动；
    </p>
    <p>
      9.不得发布侵害他人著作权、商标权等知识产权或合法权利的内容；
    </p>
    <p>
      10.其他任何违法活动或者有违社会公共利益或公共道德的行为
    </p>
    <h3>
      七、风险提示及免责声明
    </h3>
    <p>
      <b>
        第二十八条 除非另有书面协议约定，本平台在任何情况下，对用户使用本平台服务而产生的任何形式的直接或间接损失均不承担法律责任，包括但不限于资金损失、收益损失等。
      </b>
    </p>
    <p>
      <b>
        第二十九条 本平台不能对用户发布的信息进行控制，没有义务为该信息承担证明义务。本平台不能完全保证平台所有用户信息内容的真实性、准确性或完整性，所有信息仅供参考，用户应对自己的判断承担全部责任。
      </b>
    </p>
    <p>
      <b>
        第三十条 任何本平台之外的第三方机构或个人所提供的服务，其服务品质及内容由该第三方自行、独立负责。
      </b>
    </p>
    <p>
      <b>
        第三十一条
        用户了解并认可，通过富卡进行的交易并不能规避风险。本平台无义务为交易后产生的风险承担责任，用户应知悉交易存在的风险，并在独立判断后做出交易决策，交易产生的风险由用户本人自行承担，本平台不对任何用户的任何交易提供任何明示或默示的保证。本平台只提供技术、信息服务支持，对用户使用本平台服务而自愿与他方建立的债权债务关系与本平台无关，本平台并不是债权债务关系的当事人；用户根据债权债务关系主张权利时，不得将本平台列为共同被告，也不得要求本平台就该债务承担连带责任。
      </b>
    </p>
    <p>
      <b>
        第三十二条 因不可抗力或本平台服务器死机、网络故障、数据库故障、软件升级等问题造成的服务中断和对用户个人数据及资料造成的损失，本平台不承担任何责任，亦不予赔偿，但将尽力减少因此而给用户造成的损失和影响。
      </b>
    </p>
    <p>
      <b>
        第三十三条 因黑客、病毒或密码被盗、泄露等非本平台原因造成损失概由用户本人自行承担。
      </b>
    </p>
    <p>
      <b>
        第三十四条 用户须对其本人在使用本平台所提供的服务时的一切行为、行动（不论是否故意）负全部责任。
      </b>
    </p>
    <p>
      <b>
        第三十五条 当司法机关、政府部门或其他监管机构根据有关法律、法规、规章及其他政府规范性文件的规定和程序，要求本平台提供用户信息资料，本平台对据此做出的任何披露，概不承担责任。
      </b>
    </p>
    <h3>
      八、电子合同
    </h3>
    <p>
      第三十六条
      在使用本平台服务进行资金交易过程中需订立的合同采用电子文本形式，可以有一份或多份，并且每一份具有同等法律效力。用户或用户的代理人根据有关合同及本平台的相关规则在本平台确认签署的电子合同即视为用户本人真实意愿并均视为本人名义签署的合同，具有法律效力。用户应妥善保管自己的账户密码等账户信息，用户通过前述方式订立的电子合同对合同各方具有法律约束力，且不得以账户密码等账户信息被盗用或其他理由否认已订立的合同的效力或不按照该等合同履行相关义务。
    </p>
    <p>
      第三十七条
      用户根据本协议以及本平台的相关规则签署电子合同后，不得擅自修改该合同。本平台向用户提供电子合同的保管、查询等服务，如对电子合同的内容有任何疑问，用户可通过本平台的相关系统板块查阅有关合同。如对此有任何争议，应以本平台记录的合同为准。
    </p>
    <h3>
      九、用户注销、暂停、终止或限制访问
    </h3>
    <p>
      第三十八条
      如果用户决定不再使用本平台服务时，应首先清偿所有应付款项（包括但不限于借款本金、利息、服务费、违约金、逾期管理服务费等），再将本人用户的账户下所对应的可用款项（如有）全部提现或者向本平台发出其他合法的支付指令，并向本平台申请注销（或永久冻结）该用户账户，经本平台审核同意后可正式注销该用户账户。
    </p>
    <p>
      第三十九条 本平台有权基于单方独立判断，在认为可能发生危害交易安全等情形时，不经通知而先行暂停、中断或终止向用户提供本协议项下的全部或部分用户服务（包括收费服务），并将注册资料移除或删除，且无需对用户或第三方承担任何责任。
    </p>
    <p>
      第四十条
      无论本平台是否收费，只要用户利用本平台从事违法活动或者严重违反本协议的约定，本平台可在不发出任何通知的情况下立即使用户本人的账户无效，或撤销用户本人的账户以及在该账户内的所有相关资料和档案，和/或禁止用户进一步接入该等档案或服务。账号终止后，本平台没有义务为用户保留原账号中或与之相关的任何信息，或转发任何未曾阅读或发送的信息给用户或第三方。此外，本平台亦不会就终止用户账户使用而对用户或第三者承担任何责任。
    </p>
    <p>
      第四十一条 用户账户的暂停、中断或终止不代表用户责任的终止，用户仍应对其使用本平台提供的服务期间的行为承担可能的违约或损害赔偿责任，同时本平台仍可保有用户的相关信息。
    </p>
    <h3>
      十、知识产权保护
    </h3>
    <p>
      第四十二条
      本平台所有内容和服务，包括但不限于平台的整体结构、网页设计、文字、图片、图标、软件、视频文件、音频文件、广告以及本平台为用户提供的其它信息或资料，其知识产权属本平台所有。未经本平台书面许可，任何人不得为了商业目的进行复制或者以其它方式进行非法使用。
    </p>
    <p>
      第四十三条 任何未经授权许可而使用本平台内容的行为均属于违法行为，本平台保留追究相关使用人法律责任的权利。
    </p>
    <h3>
      十一、违约责任
    </h3>
    <p>
      第四十四条 用户因违反本协议或本协议项下的其他文件，或违反了任何法律、法规的规定，给本平台造成损失的，应予赔偿，赔偿范围包括但不限于本平台的直接损失、间接损失以及维权费用等。
    </p>
    <p>
      第四十五条
      用户因违反前款规定而侵害了第三方的权利，导致本平台遭受任何第三方提起的索赔、诉讼或行政赔偿，用户承诺无条件承担相应责任并使本平台免责。若因此给本平台造成损失的，应予赔偿，赔偿范围包括但不限于本平台的维权费用、名誉损失以及本平台向第三方支付的补偿金或/和赔偿金等。
    </p>
    <p>
      <b>
        第四十六条 用户提供给本平台错误或不真实信息给本平台造成损失的，本平台有权要求用户承担由此造成的一切直接和间接损失。
      </b>
    </p>
    <h3>
      十二、保密条款
    </h3>
    <p>
      第四十七条 对于本平台用户在接受本平台提供的各项服务过程中了解到的所有信息，包括但不限于本平台信息资料、业务运营情况、商业秘密等，不得向任何第三人披露。
    </p>
    <p>
      第四十八条 除本协议另有约定外，本平台须根据中国法律的规定对本平台用户个人信息、资产情况和相关资料予以保密。
    </p>
    <h3>
      十三、税费缴纳
    </h3>
    <p>
      第四十九条 本平台用户在使用本平台提供的各项服务过程中产生的相关税收缴纳义务，请根据中国法律的规定自行向其主管税务机关申报、缴纳，本平台不承担任何代扣代缴的义务及责任。
    </p>
    <h3>
      十四、信息变更
    </h3>
    <p>
      第五十条 本平台用户如变更账户信息、通讯地址、电话号码等相关重要信息，须及时通知本平台。因用户未及时通知而导致自身受到的一切损失，由本人自行承担责任。
    </p>
    <h3>
      十五、继承或赠与
    </h3>
    <p>
      第五十一条
      如果本平台用户出现投资（出借）资金的继承或赠与，必须由主张权利的继承人或受赠人向本平台出示经公证机关公证的继承或赠与权利归属证明文件，经本平台确认后方可予以协助办理资产权属变更手续，由此产生的相关税费，由主张权利的继承人或受赠人向其主管税务机关申报、缴纳，本平台不负责相关事宜处理。
    </p>
    <h3>
      十六、争议的处理
    </h3>
    <p>
      第五十二条 凡因执行本协议或本协议有关的一切争议，均提请衢州仲裁委员会仲裁，并适用其网络仲裁规则（包括适用互联网金融仲裁特别规定条款），衢州仲裁委员会的裁决为终局裁决，对双方具有法律约束力。
    </p>
    <p>
      用户确认以<u class="sign">{{emailAddress?emailAddress:'________________'}}</u>为联络邮箱，为双方之间及涉诉纠纷相关材料送达地址；并以<u class="sign">{{phone?phone:'________________'}}</u>为联络手机号码，为短信通知号码。按本协议约定由任何一方发给其他方的任何通知，应以电子邮件或者短信等形式发出，送至约定邮箱或者手机号码。收件人指定系统接受材料或通知之日，即视为送达和收到之日。如一方需变更联络邮箱或者手机号码的，应当书面通知并得到对方确认。
    </p>
    <h3>
      十七、其他
    </h3>
    <p>
      第五十三条 本协议中的任何条款或部分条款因违反中国法律而无效的，不影响本协议其他条款的效力。
    </p>
    <p>
      第五十四条 本平台对本协议有最终解释权。
    </p>
    <p>
      第五十五条 用户在审阅完毕本协议文本时，已阅读并自愿做出以下承诺：
    </p>
    <h2>
      "本人已经阅读本协议所有条款，充分了解并清楚知晓相应的权利义务，并愿意承担相关风险。"
    </h2>
    <p>
      手机号：________________
    </p>
    <p>
      日期：________________
    </p>
  </div>
</template>

<script>
  export default {
    name: "users-register-login",
    data() {
      return {
        phone: this.$route.query.phone,
        emailAddress: this.$route.query.emailAddress,
      }
    },
    mounted() {
      document.title = '用户注册登录协议'
    }
  }
</script>

<style scoped lang="less">
  .protocol {
    width: 100%;
    display: flex;
    flex-direction: column;
    justify-content: center;
    align-items: center;
    font-size: 0.28rem;
    line-height: 0.42rem;
    padding-bottom: 1rem;

    .sign {
      color: #45403d;
      font-weight: bolder;
    }

    p {
      width: 92%;
      margin-top: 0.32rem;
    }

    h3 {
      width: 92%;
      margin-top: 0.6rem;
    }

    h2 {
      width: 92%;
      line-height: 0.8rem;
      margin-top: 0.3rem;
    }
  }
</style>
